## Join

In [16]:
import pandas as pd

# Left DataFrame
df1 = pd.DataFrame({
    'emp_id': [1, 2, 3, 4],
    'name': ['Dipak', 'Sita', 'Ram', 'Gita'],
    'dept_id': [101, 102, 101, 103]
})

df1

   emp_id   name  dept_id
0       1  Dipak      101
1       2   Sita      102
2       3    Ram      101
3       4   Gita      103

In [17]:
# Right DataFrame
df2 = pd.DataFrame({
    'dept_id': [101, 102, 103],
    'department': ['IT', 'HR', 'Finance']
})

df2

   dept_id department
0      101         IT
1      102         HR
2      103    Finance

In [18]:
# Set index to dept_id for both DataFrames
df1.set_index('dept_id', inplace=True)
df2.set_index('dept_id', inplace=True)

# Join using index
joined_df = df1.join(df2)
joined_df

         emp_id   name department
dept_id
101           1  Dipak         IT
102           2   Sita         HR
101           3    Ram         IT
103           4   Gita    Finance